# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "oven-sh/bun"
brew "mas"

brew "xz"
brew "bash-completion@2"
brew "bun"
brew "cmake"
brew "curl"
brew "dive"
brew "docker-completion"
brew "docker-slim"
brew "git"
brew "grep" # https://superuser.com/a/419527
brew "jq"
brew "libpq" # https://stackoverflow.com/a/49689589
brew "node@20"
brew "openjdk"
brew "openssl@1.1"
brew "postgresql@15"
brew "pyenv"
brew "rustup-init"
brew "tree"
brew "vim"
brew "vips" # https://stackoverflow.com/a/66676895
brew "wget"

cask "google-cloud-sdk"
