# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "modularml/packages"
tap "oven-sh/bun"

brew "bash-completion@2"
brew "cmake"
brew "curl"
brew "dive"
brew "docker-completion"
brew "docker-slim"
brew "git"
brew "grep" # https://superuser.com/a/419527
brew "jq"
brew "libpq" # https://stackoverflow.com/a/49689589
brew "mas"
brew "node@20"
brew "openjdk"
brew "openssl@1.1"
brew "oven-sh/bun/bun"
brew "postgresql@15"
brew "pyenv"
brew "rustup-init"
brew "tree"
brew "vim"
brew "vips" # https://stackoverflow.com/a/66676895
brew "wget"
brew "xz"

cask "google-cloud-sdk"

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "ambar.bundle-size"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
